	IDENTIFICATION DIVISION.
	PROGRAM-ID. ABC150a.

	ENVIRONMENT DIVISION.

	DATA DIVISION.
	WORKING-STORAGE SECTION.
	01 K PIC 9(6).
	01 X PIC 9(6).

	PROCEDURE DIVISION.
	*>	your code goes here
		ACCEPT K.
		ACCEPT X.
		COMPUTE K = K * 500.
		IF K >= X THEN
			DISPLAY "Yes"
		ELSE 
			DISPLAY "No"
		END-IF.
		STOP RUN.
