IDENTIFICATION DIVISION.
PROGRAM-ID. NOMURA-B.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
  SELECT STDIO ASSIGN TO KEYBOARD. 
*>
DATA DIVISION.
FILE SECTION.
FD STDIO.
01 T          PIC X(200000).
*>
WORKING-STORAGE SECTION.
01 OUT        PIC X(200000).
*>
PROCEDURE DIVISION.
  OPEN INPUT STDIO.
  READ STDIO.         
  CLOSE STDIO.
*>
  MOVE T TO OUT
  INSPECT OUT REPLACING ALL '?' BY 'D'.
*>
  DISPLAY FUNCTION TRIM(OUT)
  STOP RUN.
