IDENTIFICATION DIVISION.
PROGRAM-ID. 172A.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 A          PIC 9(02).
01 OUT        PIC ZZZ9.
*>
PROCEDURE DIVISION.
  ACCEPT A.
*>
  COMPUTE OUT = A + A ** 2 + A ** 3.
  DISPLAY FUNCTION TRIM(OUT).
*>
  STOP RUN.
