IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 ln         PIC X(30).
01 A          PIC S9(10).
01 B          PIC S9(10).
01 ans        PIC S9(10).
01 zs         PIC S9(10).


PROCEDURE DIVISION.
  ACCEPT ln.
  UNSTRING ln DELIMITED BY SPACE INTO A B.
  COMPUTE ans = FUNCTION MAX(A + B, A - B, A * B).
  MOVE ans TO zs.
  DISPLAY zs.
  STOP RUN.
