IDENTIFICATION DIVISION.
PROGRAM-ID. 159C.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 L          PIC 9(4).
01 H          PIC 9(3)V9(8).
01 OUT        PIC Z(7)9.9(7).
*>
PROCEDURE DIVISION.
MAIN-001.
  ACCEPT L.
*>
  COMPUTE H = L / 3.
  COMPUTE OUT = H ** 3.
*>
  DISPLAY FUNCTION TRIM(OUT).
  STOP RUN.
