IDENTIFICATION DIVISION.
PROGRAM-ID. A-Diagonal.
 
DATA DIVISION.
WORKING-STORAGE SECTION.
01 C1     PIC X(3).
01 C2     PIC X(3).
01 C3     PIC X(3).
 
PROCEDURE DIVISION.
  ACCEPT C1.
  ACCEPT C2.
  ACCEPT C3.

  DISPLAY C1(1:1) C2(2:1) C3(3:1).

  STOP RUN.
