 IDENTIFICATION DIVISION.
 PROGRAM-ID. TEST121.

 ENVIRONMENT DIVISION.

 DATA DIVISION.
 WORKING-STORAGE SECTION.

 01 INP   PIC X(10).
 01 H1    PIC 9(2).
 01 W1    PIC 9(2).
 01 H2    PIC 9(2).
 01 W2    PIC 9(2).
 01 WK    PIC 9(5).
 01 ANS   PIC ZZZZ9.

 PROCEDURE DIVISION.

 ACCEPT INP.
 UNSTRING INP DELIMITED BY ' '
  INTO H1 W1.

 ACCEPT INP.
 UNSTRING INP DELIMITED BY ' '
  INTO H2 W2.

 COMPUTE WK = (H1 - H2) * (H1 - H2).
 MOVE WK TO ANS.
 DISPLAY ANS.

 STOP RUN.  