IDENTIFICATION DIVISION.
PROGRAM-ID. ALREADY.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 S PIC X(10).
PROCEDURE DIVISION.
ACCEPT S.
MOVE "2018" TO S(1:4).
DISPLAY S.
STOP RUN.
