IDENTIFICATION DIVISION.
PROGRAM-ID. 163A.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 R          PIC 9(3).
01 OUT        PIC Z(3).9(4).
*>
PROCEDURE DIVISION.
  ACCEPT R.
*>
  COMPUTE OUT = R * 2 * 3.1415926.
*>
  DISPLAY FUNCTION TRIM(OUT).
  STOP RUN.
